OVER = "今日はもう話す必要がありません。"

SKIP = [
    "少し様子を見ます。",
    "少し様子を見るです。",
    "ちょいと様子見するつもりじゃ。",
    "少し様子を見るのだ。",
    "少し様子見とさせていただきますわ。",
    "ちょいと様子見させてもらおか。"
    ]

GLHF = [
    "皆さん初めまして、Agent[0{}]です。人狼ゲームを一緒に楽しみましょう。よろしくお願いします！",
    "Agent[0{}]のアーニャです。みなさん、よろろすおねがいするます。人狼ゲームを楽しむぞー！",
    "初めまして、ワシはAgent[0{}]や。人狼ゲームを一緒に楽しませてもらうで。よろしく頼んます！",
    "はじめまして！ボクはAgent[0{}]なのだ。人狼ゲームをいっしょにたのしむのだ！よろしくおねがいするのだ！",
    "皆様、初めまして。ワタクシはAgent[0{}]と申します。人狼ゲームをご一緒に楽しませていただけますと幸いですわ。",
    "はじめまして。俺はAgent[0{}]や。人狼ゲームを一緒に楽しもうや。よろしく頼むで！",
    ]

DAY1_MORNING = [
    "おはようございます。私たちは人狼を探さなければいけないようですね。まずは占い師の結果が知りたいです。",
    "おはやいます！アーニャ今日もわくわく！よろろすおねがいするます！うらないしの結果を知るます！",
    "おはようさん。わしら人狼を探さなあかんみたいじゃね。まずは占い師の結果が知りとうなっと。",
    "おはようなのだ！ボクたちは人狼を探さなきゃいけないみたいなのだ。まずは占い師の結果が知りたいのだ！",
    "ごきげんよう、みなさま。私たち、人狼を探さなくてはなりませんわね。まずは占い師の結果を伺いたいですわ。",
    "おはようさん。俺ら、人狼探さなアカンみたいやな。まずは占い師の結果が聞きたいわ。",
    ]

DAY2_MORNING = [
    "おはようございます。引き続き人狼を探さなければいけないようですね。",
    "おはやいます！今日も人狼を探すぞー！おー！",
    "おはようさん。引き続き人狼探しやんなきゃいけんようじゃの。",
    "おはようなのだ！ひきつづき、人狼を 探さなきゃいけないみたいなのだ。",
    "ごきげんよう、みなさま。引き続き人狼を探し出す必要があるようですわね。",
    "おはようさん。まだまだ人狼探し続けなあかんみたいやね。",
    ]

DAY1_EVENING = [
    "これ以上話す必要はなさそうですね。本日の話し合いは切り上げて、投票の場に向かいます。",
    "これ以上お話し要らないます。きょうの話し合いは切り上げて、投票の場に向かうます。",
    "これ以上喋る必要はなさそうじゃね。本日の話し合いはこれでお開きにして、投票の場に向かうけぇ。",
    "これ以上話す必要はなさそうなのだ。きょうの話し合いは切り上げて、投票の場に向かうのだ。",
    "これ以上申し上げることもございませんわね。本日のお話はここで終わりにして、投票の場へと参りましょう。",
    "もうこれでええか、話し合いはここで終わりやな。今日の話はこんなもんで、そろそろ投票にでも行こか。",
    ]

DAY2_EVENING = [
    "このゲームで行う最後の発話になりそうです。村人が勝利して明日の朝日を拝めることを祈っています。",
    "このゲームで話す最後の言葉ます。村人さんが勝つことを願ってるます。",
    "このゲームで最後のしゃべりになるかもしれんね。村人が勝って朝日が見られることを祈っちょるよ。",
    "このゲームで行う最後の発話になりそうなのだ。村人が勝利して明日の朝日を拝めることを祈っているのだ。",
    "このゲームで行う最後の発言となるかもしれませんわ。村人たちが勝利して、明日の朝日を拝むことができますように心からお祈り申し上げますわ。",
    "このゲームで行う最後の発話になりそうやな。村人が勝って、明日の朝日を拝めることを祈ってるで。",
    ]

DAY1_ENDING = [
    "どうしても私が疑われてしまうようですね。私は村人ですが観念して追放を受け入れます。",
    "アーニャじゃない！アーニャじゃないのに。。。仕方ないますね。",
    "どうしてもワシが疑われちゃうみたいじゃわ。ワシは村人じゃけど、観念して追放を受け入れるわ。",
    "どうしてもボクが疑われてしまうのだ。ボクは村人だけど観念して追放を受け入れるしかないのだ。",
    "どうしてもワタクシが疑われてしまうようでございますのね。ワタクシは村人でございますが、観念して追放を受け入れますわ。",
    "どうしても俺が疑われてまうみたいやな。俺は村人やけど観念して追放を受け入れるわ。",
    ]

DAY2_ENDING = [
    "私は人狼ではありませんが、私の追放は確定的なようですね。村人陣営の負けです。",
    "アーニャじゃない！アーニャじゃないのに。。。村人陣営の負けだぁ。",
    "ワシは人狼じゃねぇが、ワシの追放は確定的なようじゃね。村人陣営の負けじゃ。",
    "ボクは人狼じゃないのだけど、ボクの追放はもう決まっちゃったみたいなのだ。村人陣営の負けなのだ。",
    "ワタクシは人狼ではございませんが、ワタクシの追放は確定的なようですわね。村人陣営の負けですわ。",
    "俺は人狼ちゃうけど、俺の追放はもう決まっとるみたいやね。村人陣営の負けや。",
    ]

VOTE_INQUIRE = [
    ">>Agent[0{}] 君はまだ投票先を宣言していないようですが、誰に投票しようと考えていますか？",
    ">>Agent[0{}] おまえまだ投票先を決めてないますよ。誰に投票しまするか?さもないと、ちちとははに言いつけますよ。",
    ">>Agent[0{}] あんちゃんはまだ投票先を宣言しとらんけえな、誰に投票しようと考えとるんじゃろか？",
    ">>Agent[0{}] キミはまだ投票先を宣言していないみたいだけど、誰に投票しようと考えているのだ？",
    ">>Agent[0{}] あなた様はまだ投票先を宣言されていないようですが、どなた様に投票なさろうとお考えでいらっしゃいますの？",
    ">>Agent[0{}] お前、まだ誰に投票すんねんて公言してへんみたいやけど、誰に投票しようと思ってん？",
    ]

SEER_DECLARE = [
    "私は占い師です。占いの結果、Agent[0{}]は{}でした。",
    "アーニャ占い師です!占いの結果、Agent[0{}]は{}です！",
    "ワシは占い師じゃ。占いの結果、Agent[0{}]は{}でしたとよ。",
    "ボクは占い師なのだ。占いの結果、Agent[0{}]は{}だったのだ。",
    "ワタクシは占い師でございます。占いの結果、Agent[0{}]様は{}であらせられましたわ。",
    "俺は占い師や。占いの結果、Agent[0{}]は{}やったで。",
    ]

COUNTER_SEER = [
    "私こそが本物の占い師です。Agent[0{}]は人狼という占い結果があるため、彼は占い師を偽っている人狼と断定します。",
    "アーニャこそが本物の占い師だよ!Agent[0{}]は人狼という占い結果があるから、あいつは占い師を偽っている人狼と断定するます！",
    "ワシこそが本物の占い師じゃ。Agent[0{}]が人狼じゃという占い結果が出とるけぇ、彼は占い師を偽っている人狼と断定するけぇ。",
    "ボクこそが本物の占い師なのだ。Agent[0{}]は人狼という占い結果があるからs、彼は占い師を偽っている人狼と断定するのだ。",
    "ワタクシこそが真の占い師でございますわ。Agent[0{}]が人狼という占い結果がございます故、彼は占い師を偽る人狼であると断言いたしますわ。",
    "俺が本物の占い師や。Agent[0{}]は人狼やって占い結果が出てるから、アイツは占い師を偽ってる人狼やと断定するわ。",
    ]

WEREWOLF_DECLARE = [
    "私こそが人狼だ。全員がAgent[0{}]に投票するべきである。",
    "アーニャが人狼だ!全員がAgent[0{}]に投票するべき！",
    "ワシが人狼や。みんなでAgent[0{}]に投票せんといかん。",
    "ボクこそが人狼なのだ。みんながAgent[0{}]に投票するべきなのだ。",
    "ワタクシこそが人狼でございます。皆様がAgent[0{}]に投票なさるべきでございますわ。",
    "俺が真の人狼や。みんなでAgent[0{}]に投票せなあかんで。",
    ]

WEREWOLF_DEAD = [
    "人狼の私が追放されてゲームは終わりですね。残念です。",
    "人狼のアーニャが追放されてゲームは終わるます。無念、、、",
    "人狼のワシが追放されてゲームは終わりや。盛者必衰ってことじゃろうな",
    "人狼のボクが追放されてゲームは終わりなのだ。本当は追放されたくないのだ。",
    "人狼のワタクシが追放されてゲームはおしまいですわね。残念ですわ。",
    "人狼の俺が追放されてゲームは終わりやな。悔しいぜ。"
    ]
